{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|endoftext|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "0": 1,
      "1": 2,
      "2": 3,
      "3": 4,
      "4": 5,
      "5": 6,
      "6": 7,
      "7": 8,
      "8": 9,
      "9": 10,
      "20": 11,
      "10": 12,
      "16": 13,
      "12": 14,
      "40": 15,
      "15": 16,
      "80": 17,
      "13": 18,
      "14": 19,
      "60": 20,
      "18": 21,
      "30": 22,
      "17": 23,
      "19": 24,
      "25": 25,
      "24": 26,
      "28": 27,
      "90": 28,
      "36": 29,
      "35": 30,
      "75": 31,
      "96": 32,
      "45": 33,
      "76": 34,
      "26": 35,
      "48": 36,
      "70": 37,
      "38": 38,
      "32": 39,
      "95": 40,
      "98": 41,
      "44": 42,
      "78": 43,
      "72": 44,
      "34": 45,
      "50": 46,
      "56": 47,
      "39": 48,
      "46": 49,
      "22": 50,
      "88": 51,
      "37": 52,
      "64": 53,
      "92": 54,
      "55": 55,
      "27": 56,
      "94": 57,
      "68": 58,
      "65": 59,
      "97": 60,
      "33": 61,
      "77": 62,
      "42": 63,
      "85": 64,
      "99": 65,
      "11": 66,
      "84": 67,
      "54": 68,
      "74": 69,
      "66": 70,
      "29": 71,
      "23": 72,
      "100": 73,
      "73": 74,
      "52": 75,
      "160": 76,
      "79": 77,
      "86": 78,
      "49": 79,
      "120": 80,
      "110": 81,
      "140": 82,
      "150": 83,
      "58": 84,
      "63": 85,
      "93": 86,
      "43": 87,
      "180": 88,
      "200": 89,
      "112": 90,
      "62": 91,
      "113": 92,
      "82": 93,
      "47": 94,
      "170": 95,
      "57": 96,
      "69": 97,
      "67": 98,
      "300": 99,
      "118": 100,
      "119": 101,
      "83": 102,
      "800": 103,
      "168": 104,
      "59": 105,
      "53": 106,
      "144": 107,
      "115": 108,
      "400": 109,
      "208": 110,
      "600": 111,
      "114": 112,
      "104": 113,
      "89": 114,
      "250": 115,
      "256": 116,
      "720": 117,
      "125": 118,
      "350": 119,
      "336": 120,
      "116": 121,
      "450": 122,
      "240": 123,
      "190": 124,
      "288": 125,
      "126": 126,
      "750": 127,
      "128": 128,
      "384": 129,
      "320": 130,
      "480": 131,
      "176": 132,
      "220": 133,
      "130": 134,
      "135": 135,
      "700": 136,
      "108": 137,
      "248": 138,
      "900": 139,
      "105": 140,
      "640": 141,
      "280": 142,
      "960": 143,
      "312": 144,
      "224": 145,
      "230": 146,
      "165": 147,
      "238": 148,
      "21": 149,
      "215": 150,
      "408": 151,
      "376": 152,
      "87": 153,
      "184": 154,
      "360": 155,
      "136": 156,
      "158": 157,
      "980": 158,
      "304": 159,
      "752": 160,
      "950": 161,
      "296": 162,
      "880": 163,
      "156": 164,
      "340": 165,
      "784": 166,
      "370": 167,
      "392": 168,
      "117": 169,
      "325": 170,
      "138": 171,
      "328": 172,
      "368": 173,
      "380": 174,
      "736": 175,
      "920": 176,
      "252": 177,
      "226": 178,
      "132": 179,
      "390": 180,
      "51": 181,
      "91": 182,
      "264": 183,
      "768": 184,
      "195": 185,
      "235": 186,
      "348": 187,
      "204": 188,
      "214": 189,
      "420": 190,
      "182": 191,
      "760": 192,
      "106": 193,
      "315": 194,
      "990": 195,
      "178": 196,
      "192": 197,
      "258": 198,
      "740": 199,
      "284": 200,
      "512": 201,
      "196": 202,
      "216": 203,
      "660": 204,
      "164": 205,
      "198": 206,
      "255": 207,
      "330": 208,
      "396": 209,
      "152": 210,
      "356": 211,
      "272": 212,
      "344": 213,
      "520": 214,
      "175": 215,
      "149": 216,
      "770": 217,
      "244": 218,
      "197": 219,
      "500": 220,
      "236": 221,
      "326": 222,
      "398": 223,
      "440": 224,
      "560": 225,
      "944": 226,
      "169": 227,
      "952": 228,
      "345": 229,
      "338": 230,
      "187": 231,
      "218": 232,
      "375": 233,
      "504": 234,
      "544": 235,
      "266": 236,
      "766": 237,
      "317": 238,
      "378": 239,
      "970": 240,
      "405": 241,
      "146": 242,
      "490": 243,
      "286": 244,
      "145": 245,
      "254": 246,
      "260": 247,
      "275": 248,
      "245": 249,
      "968": 250,
      "704": 251,
      "377": 252,
      "656": 253,
      "780": 254,
      "124": 255,
      "133": 256,
      "174": 257,
      "185": 258,
      "905": 259,
      "217": 260,
      "148": 261,
      "276": 262,
      "695": 263,
      "155": 264,
      "294": 265,
      "795": 266,
      "209": 267,
      "109": 268,
      "154": 269,
      "134": 270,
      "608": 271,
      "305": 272,
      "308": 273,
      "352": 274,
      "107": 275,
      "456": 276,
      "265": 277,
      "385": 278,
      "416": 279,
      "476": 280,
      "792": 281,
      "864": 282,
      "137": 283,
      "194": 284,
      "984": 285,
      "374": 286,
      "206": 287,
      "354": 288,
      "329": 289,
      "988": 290,
      "324": 291,
      "808": 292,
      "139": 293,
      "268": 294,
      "1008": 295,
      "964": 296,
      "458": 297,
      "314": 298,
      "448": 299,
      "935": 300,
      "788": 301,
      "225": 302,
      "310": 303,
      "432": 304,
      "162": 305,
      "465": 306,
      "270": 307,
      "975": 308,
      "205": 309,
      "756": 310,
      "516": 311,
      "576": 312,
      "798": 313,
      "606": 314,
      "210": 315,
      "335": 316,
      "414": 317,
      "364": 318,
      "955": 319,
      "945": 320,
      "129": 321,
      "188": 322,
      "486": 323,
      "372": 324,
      "728": 325,
      "865": 326,
      "488": 327,
      "949": 328,
      "790": 329,
      "1280": 330,
      "186": 331,
      "908": 332,
      "956": 333,
      "612": 334,
      "748": 335,
      "940": 336,
      "189": 337,
      "555": 338,
      "239": 339,
      "31": 340,
      "313": 341,
      "913": 342,
      "418": 343,
      "430": 344,
      "627": 345,
      "485": 346,
      "552": 347,
      "764": 348,
      "227": 349,
      "298": 350,
      "625": 351,
      "705": 352,
      "346": 353,
      "568": 354,
      "228": 355,
      "316": 356,
      "904": 357,
      "759": 358,
      "565": 359,
      "399": 360,
      "745": 361,
      "263": 362,
      "322": 363,
      "974": 364,
      "744": 365,
      "1088": 366,
      "1440": 367,
      "246": 368,
      "366": 369,
      "355": 370,
      "739": 371,
      "102": 372,
      "455": 373,
      "765": 374,
      "290": 375,
      "534": 376,
      "665": 377,
      "746": 378,
      "1056": 379,
      "357": 380,
      "966": 381,
      "319": 382,
      "616": 383,
      "758": 384,
      "395": 385,
      "716": 386,
      "1480": 387,
      "708": 388,
      "349": 389,
      "213": 390,
      "806": 391,
      "172": 392,
      "1728": 393,
      "518": 394,
      "690": 395,
      "678": 396,
      "688": 397,
      "778": 398,
      "912": 399,
      "915": 400,
      "972": 401,
      "986": 402,
      "658": 403,
      "772": 404,
      "928": 405,
      "976": 406,
      "278": 407,
      "475": 408,
      "730": 409,
      "738": 410,
      "605": 411,
      "358": 412,
      "452": 413,
      "318": 414,
      "339": 415,
      "712": 416,
      "794": 417,
      "825": 418,
      "1296": 419,
      "754": 420,
      "386": 421,
      "888": 422,
      "719": 423,
      "1875": 424,
      "464": 425,
      "337": 426,
      "919": 427,
      "1254": 428,
      "965": 429,
      "4896": 430,
      "234": 431,
      "233": 432,
      "439": 433,
      "598": 434,
      "646": 435,
      "836": 436,
      "916": 437,
      "143": 438,
      "508": 439,
      "3740": 440,
      "686": 441,
      "710": 442,
      "992": 443,
      "142": 444,
      "602": 445,
      "1980": 446,
      "2592": 447,
      "285": 448,
      "987": 449,
      "1104": 450,
      "1100": 451,
      "437": 452,
      "540": 453,
      "536": 454,
      "724": 455,
      "1690": 456,
      "231": 457,
      "1198": 458,
      "435": 459,
      "495": 460,
      "596": 461,
      "574": 462,
      "648": 463,
      "775": 464,
      "833": 465,
      "1085": 466,
      "166": 467,
      "122": 468,
      "157": 469,
      "804": 470,
      "1330": 471,
      "985": 472,
      "657": 473,
      "1108": 474,
      "1400": 475,
      "1500": 476,
      "1904": 477,
      "219": 478,
      "295": 479,
      "436": 480,
      "717": 481,
      "840": 482,
      "910": 483,
      "1285": 484,
      "1568": 485,
      "1938": 486,
      "2568": 487,
      "9860": 488,
      "4432": 489,
      "3448": 490,
      "507": 491,
      "558": 492,
      "429": 493,
      "1120": 494,
      "528": 495,
      "594": 496,
      "817": 497,
      "924": 498,
      "922": 499,
      "1655": 500,
      "1232": 501,
      "9520": 502,
      "273": 503,
      "2720": 504,
      "470": 505,
      "477": 506,
      "620": 507,
      "876": 508,
      "832": 509,
      "1040": 510,
      "762": 511,
      "484": 512,
      "388": 513,
      "327": 514,
      "4412": 515,
      "222": 516,
      "4240": 517,
      "3000": 518,
      "417": 519,
      "672": 520,
      "932": 521,
      "997": 522,
      "2016": 523,
      "1885": 524,
      "468": 525,
      "9790": 526,
      "232": 527,
      "595": 528,
      "147": 529,
      "1456": 530,
      "1970": 531,
      "442": 532,
      "462": 533,
      "2736": 534,
      "1130": 535,
      "1168": 536,
      "2160": 537,
      "332": 538,
      "514": 539,
      "570": 540,
      "578": 541,
      "629": 542,
      "1045": 543,
      "153": 544,
      "1375": 545,
      "1352": 546,
      "179": 547,
      "1760": 548,
      "4599": 549,
      "9820": 550,
      "7860": 551,
      "6480": 552,
      "334": 553,
      "526": 554,
      "538": 555,
      "573": 556,
      "718": 557,
      "737": 558,
      "938": 559,
      "1038": 560,
      "1677": 561,
      "406": 562,
      "1360": 563,
      "3040": 564,
      "902": 565,
      "454": 566,
      "323": 567,
      "9568": 568,
      "729": 569,
      "3977": 570,
      "9490": 571,
      "684": 572,
      "630": 573,
      "735": 574,
      "930": 575,
      "1290": 576,
      "1520": 577,
      "1325": 578,
      "1376": 579,
      "1872": 580,
      "3024": 581,
      "4580": 582,
      "2640": 583,
      "2690": 584,
      "847": 585,
      "2396": 586,
      "292": 587,
      "3180": 588,
      "434": 589,
      "556": 590,
      "615": 591,
      "664": 592,
      "896": 593,
      "926": 594,
      "1550": 595,
      "1328": 596,
      "1344": 597,
      "1475": 598,
      "909": 599,
      "3654": 600,
      "3512": 601,
      "381": 602,
      "3878": 603,
      "342": 604,
      "3496": 605,
      "5040": 606,
      "3960": 607,
      "3975": 608,
      "884": 609,
      "3734": 610,
      "1200": 611,
      "1188": 612,
      "212": 613,
      "297": 614,
      "496": 615,
      "499": 616,
      "530": 617,
      "524": 618,
      "592": 619,
      "696": 620,
      "799": 621,
      "81": 622,
      "918": 623,
      "917": 624,
      "2056": 625,
      "1032": 626,
      "1860": 627,
      "306": 628,
      "1920": 629,
      "289": 630,
      "9664": 631,
      "9760": 632,
      "5280": 633,
      "1600": 634,
      "7925": 635,
      "4928": 636,
      "3135": 637,
      "410": 638,
      "634": 639,
      "650": 640,
      "776": 641,
      "845": 642,
      "1025": 643,
      "1548": 644,
      "1320": 645,
      "1380": 646,
      "1416": 647,
      "1830": 648,
      "2535": 649,
      "243": 650,
      "3590": 651,
      "982": 652,
      "3438": 653,
      "6210": 654,
      "584": 655,
      "610": 656,
      "680": 657,
      "936": 658,
      "2046": 659,
      "1075": 660,
      "10980": 661,
      "159": 662,
      "1588": 663,
      "1594": 664,
      "1584": 665,
      "1430": 666,
      "1478": 667,
      "6020": 668,
      "3055": 669,
      "1942": 670,
      "2510": 671,
      "247": 672,
      "287": 673,
      "2865": 674,
      "4576": 675,
      "2684": 676,
      "483": 677,
      "487": 678,
      "954": 679,
      "9580": 680,
      "274": 681,
      "1152": 682,
      "311": 683,
      "478": 684,
      "427": 685,
      "71": 686,
      "1080": 687,
      "1640": 688,
      "407": 689,
      "4092": 690,
      "1345": 691,
      "171": 692,
      "1948": 693,
      "2580": 694,
      "9668": 695,
      "393": 696,
      "229": 697,
      "8512": 698,
      "1000": 699,
      "4000": 700,
      "4500": 701,
      "1160": 702,
      "545": 703,
      "550": 704,
      "546": 705,
      "624": 706,
      "715": 707,
      "714": 708,
      "848": 709,
      "934": 710,
      "933": 711,
      "1536": 712,
      "1485": 713,
      "1836": 714,
      "1756": 715,
      "2570": 716,
      "3696": 717,
      "962": 718,
      "2624": 719,
      "2646": 720,
      "9854": 721,
      "466": 722,
      "4660": 723,
      "3770": 724,
      "5544": 725,
      "9912": 726,
      "1180": 727,
      "2262": 728,
      "422": 729,
      "548": 730,
      "522": 731,
      "645": 732,
      "699": 733,
      "948": 734,
      "161": 735,
      "1510": 736,
      "1580": 737,
      "1519": 738,
      "1578": 739,
      "1546": 740,
      "603": 741,
      "6088": 742,
      "302": 743,
      "3080": 744,
      "3085": 745,
      "1725": 746,
      "1750": 747,
      "1964": 748,
      "1965": 749,
      "257": 750,
      "242": 751,
      "3588": 752,
      "7046": 753,
      "957": 754,
      "9592": 755,
      "9585": 756,
      "7856": 757,
      "343": 758,
      "4650": 759,
      "221": 760,
      "3380": 761,
      "2915": 762,
      "2330": 763,
      "7325": 764,
      "5295": 765,
      "580": 766,
      "676": 767,
      "733": 768,
      "207": 769,
      "1036": 770,
      "1068": 771,
      "8028": 772,
      "1335": 773,
      "1424": 774,
      "1497": 775,
      "2555": 776,
      "7535": 777,
      "9640": 778,
      "347": 779,
      "394": 780,
      "4640": 781,
      "2276": 782,
      "3332": 783,
      "7732": 784,
      "7312": 785,
      "1184": 786,
      "1150": 787,
      "299": 788,
      "3800": 789,
      "413": 790,
      "445": 791,
      "4600": 792,
      "533": 793,
      "5750": 794,
      "827": 795,
      "925": 796,
      "2019": 797,
      "1028": 798,
      "1620": 799,
      "1676": 800,
      "1668": 801,
      "1230": 802,
      "12920": 803,
      "1590": 804,
      "1556": 805,
      "1410": 806,
      "1415": 807,
      "1419": 808,
      "1428": 809,
      "1468": 810,
      "6090": 811,
      "1856": 812,
      "3016": 813,
      "177": 814,
      "2844": 815,
      "906": 816,
      "9072": 817,
      "3685": 818,
      "3542": 819,
      "262": 820,
      "2695": 821,
      "4830": 822,
      "3890": 823,
      "3275": 824,
      "446": 825,
      "7280": 826,
      "3936": 827,
      "2260": 828,
      "5520": 829,
      "279": 830,
      "3390": 831,
      "7796": 832,
      "7776": 833,
      "8480": 834,
      "1204": 835,
      "8240": 836,
      "5320": 837,
      "13872": 838,
      "2125": 839,
      "2288": 840,
      "3170": 841,
      "3750": 842,
      "419": 843,
      "492": 844,
      "4160": 845,
      "525": 846,
      "527": 847,
      "636": 848,
      "677": 849,
      "814": 850,
      "875": 851,
      "1250": 852,
      "1268": 853,
      "1266": 854,
      "4035": 855,
      "1596": 856,
      "1398": 857,
      "1346": 858,
      "1446": 859,
      "607": 860,
      "1824": 861,
      "3029": 862,
      "1778": 863,
      "1949": 864,
      "2448": 865,
      "2478": 866,
      "282": 867,
      "2836": 868,
      "755": 869,
      "7540": 870,
      "451": 871,
      "4560": 872,
      "387": 873,
      "3476": 874,
      "502": 875,
      "5684": 876,
      "2298": 877,
      "882": 878,
      "3780": 879,
      "2728": 880,
      "7360": 881,
      "1408": 882,
      "8280": 883,
      "6992": 884,
      "3187": 885,
      "588": 886,
      "599": 887,
      "9300": 888,
      "2086": 889,
      "20736": 890,
      "103": 891,
      "1078": 892,
      "10150": 893,
      "1083": 894,
      "163": 895,
      "1615": 896,
      "15504": 897,
      "1384": 898,
      "14398": 899,
      "183": 900,
      "1839": 901,
      "1710": 902,
      "2532": 903,
      "9068": 904,
      "3686": 905,
      "3540": 906,
      "7536": 907,
      "7526": 908,
      "4588": 909,
      "761": 910,
      "3296": 911,
      "3276": 912,
      "4419": 913,
      "3475": 914,
      "5056": 915,
      "5655": 916,
      "2280": 917,
      "2796": 918,
      "6545": 919,
      "7744": 920,
      "2980": 921,
      "2946": 922,
      "1602": 923,
      "4980": 924,
      "2504": 925,
      "24472": 926,
      "3248": 927,
      "31008": 928,
      "539": 929,
      "585": 930,
      "511": 931,
      "693": 932,
      "860": 933,
      "839": 934,
      "978": 935,
      "9120": 936,
      "9350": 937,
      "203": 938,
      "2080": 939,
      "20104": 940,
      "1023": 941,
      "16320": 942,
      "1295": 943,
      "4080": 944,
      "4067": 945,
      "1558": 946,
      "1312": 947,
      "1314": 948,
      "1339": 949,
      "1386": 950,
      "1864": 951,
      "1892": 952,
      "1768": 953,
      "1944": 954,
      "2526": 955,
      "249": 956,
      "2416": 957,
      "2456": 958,
      "4524": 959,
      "7695": 960,
      "2628": 961,
      "2670": 962,
      "7025": 963,
      "3856": 964,
      "953": 965,
      "441": 966,
      "722": 967,
      "3440": 968,
      "3799": 969,
      "649": 970,
      "6896": 971,
      "3317": 972,
      "1140": 973,
      "7920": 974,
      "6975": 975,
      "1190": 976,
      "831": 977,
      "3285": 978,
      "34880": 979,
      "10946": 980,
      "473": 981,
      "510": 982,
      "532": 983,
      "726": 984,
      "734": 985,
      "9248": 986,
      "2040": 987,
      "1092": 988,
      "1624": 989,
      "1650": 990,
      "127": 991,
      "1560": 992,
      "1388": 993,
      "13640": 994,
      "1472": 995,
      "1429": 996,
      "14900": 997,
      "1870": 998,
      "1850": 999
    },
    "merges": [
      [
        "2",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "2"
      ],
      [
        "4",
        "0"
      ],
      [
        "1",
        "5"
      ],
      [
        "8",
        "0"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "4"
      ],
      [
        "6",
        "0"
      ],
      [
        "1",
        "8"
      ],
      [
        "3",
        "0"
      ],
      [
        "1",
        "7"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "4"
      ],
      [
        "2",
        "8"
      ],
      [
        "9",
        "0"
      ],
      [
        "3",
        "6"
      ],
      [
        "3",
        "5"
      ],
      [
        "7",
        "5"
      ],
      [
        "9",
        "6"
      ],
      [
        "4",
        "5"
      ],
      [
        "7",
        "6"
      ],
      [
        "2",
        "6"
      ],
      [
        "4",
        "8"
      ],
      [
        "7",
        "0"
      ],
      [
        "3",
        "8"
      ],
      [
        "3",
        "2"
      ],
      [
        "9",
        "5"
      ],
      [
        "9",
        "8"
      ],
      [
        "4",
        "4"
      ],
      [
        "7",
        "8"
      ],
      [
        "7",
        "2"
      ],
      [
        "3",
        "4"
      ],
      [
        "5",
        "0"
      ],
      [
        "5",
        "6"
      ],
      [
        "3",
        "9"
      ],
      [
        "4",
        "6"
      ],
      [
        "2",
        "2"
      ],
      [
        "8",
        "8"
      ],
      [
        "3",
        "7"
      ],
      [
        "6",
        "4"
      ],
      [
        "9",
        "2"
      ],
      [
        "5",
        "5"
      ],
      [
        "2",
        "7"
      ],
      [
        "9",
        "4"
      ],
      [
        "6",
        "8"
      ],
      [
        "6",
        "5"
      ],
      [
        "9",
        "7"
      ],
      [
        "3",
        "3"
      ],
      [
        "7",
        "7"
      ],
      [
        "4",
        "2"
      ],
      [
        "8",
        "5"
      ],
      [
        "9",
        "9"
      ],
      [
        "1",
        "1"
      ],
      [
        "8",
        "4"
      ],
      [
        "5",
        "4"
      ],
      [
        "7",
        "4"
      ],
      [
        "6",
        "6"
      ],
      [
        "2",
        "9"
      ],
      [
        "2",
        "3"
      ],
      [
        "10",
        "0"
      ],
      [
        "7",
        "3"
      ],
      [
        "5",
        "2"
      ],
      [
        "16",
        "0"
      ],
      [
        "7",
        "9"
      ],
      [
        "8",
        "6"
      ],
      [
        "4",
        "9"
      ],
      [
        "1",
        "20"
      ],
      [
        "1",
        "10"
      ],
      [
        "1",
        "40"
      ],
      [
        "15",
        "0"
      ],
      [
        "5",
        "8"
      ],
      [
        "6",
        "3"
      ],
      [
        "9",
        "3"
      ],
      [
        "4",
        "3"
      ],
      [
        "1",
        "80"
      ],
      [
        "20",
        "0"
      ],
      [
        "1",
        "12"
      ],
      [
        "6",
        "2"
      ],
      [
        "1",
        "13"
      ],
      [
        "8",
        "2"
      ],
      [
        "4",
        "7"
      ],
      [
        "17",
        "0"
      ],
      [
        "5",
        "7"
      ],
      [
        "6",
        "9"
      ],
      [
        "6",
        "7"
      ],
      [
        "30",
        "0"
      ],
      [
        "1",
        "18"
      ],
      [
        "1",
        "19"
      ],
      [
        "8",
        "3"
      ],
      [
        "80",
        "0"
      ],
      [
        "16",
        "8"
      ],
      [
        "5",
        "9"
      ],
      [
        "5",
        "3"
      ],
      [
        "14",
        "4"
      ],
      [
        "1",
        "15"
      ],
      [
        "40",
        "0"
      ],
      [
        "20",
        "8"
      ],
      [
        "60",
        "0"
      ],
      [
        "1",
        "14"
      ],
      [
        "10",
        "4"
      ],
      [
        "8",
        "9"
      ],
      [
        "25",
        "0"
      ],
      [
        "25",
        "6"
      ],
      [
        "7",
        "20"
      ],
      [
        "12",
        "5"
      ],
      [
        "35",
        "0"
      ],
      [
        "3",
        "36"
      ],
      [
        "1",
        "16"
      ],
      [
        "45",
        "0"
      ],
      [
        "2",
        "40"
      ],
      [
        "19",
        "0"
      ],
      [
        "28",
        "8"
      ],
      [
        "12",
        "6"
      ],
      [
        "75",
        "0"
      ],
      [
        "12",
        "8"
      ],
      [
        "38",
        "4"
      ],
      [
        "3",
        "20"
      ],
      [
        "4",
        "80"
      ],
      [
        "17",
        "6"
      ],
      [
        "2",
        "20"
      ],
      [
        "13",
        "0"
      ],
      [
        "13",
        "5"
      ],
      [
        "70",
        "0"
      ],
      [
        "10",
        "8"
      ],
      [
        "24",
        "8"
      ],
      [
        "90",
        "0"
      ],
      [
        "10",
        "5"
      ],
      [
        "6",
        "40"
      ],
      [
        "2",
        "80"
      ],
      [
        "9",
        "60"
      ],
      [
        "3",
        "12"
      ],
      [
        "2",
        "24"
      ],
      [
        "2",
        "30"
      ],
      [
        "16",
        "5"
      ],
      [
        "2",
        "38"
      ],
      [
        "2",
        "1"
      ],
      [
        "2",
        "15"
      ],
      [
        "40",
        "8"
      ],
      [
        "3",
        "76"
      ],
      [
        "8",
        "7"
      ],
      [
        "18",
        "4"
      ],
      [
        "3",
        "60"
      ],
      [
        "13",
        "6"
      ],
      [
        "15",
        "8"
      ],
      [
        "9",
        "80"
      ],
      [
        "30",
        "4"
      ],
      [
        "75",
        "2"
      ],
      [
        "95",
        "0"
      ],
      [
        "2",
        "96"
      ],
      [
        "8",
        "80"
      ],
      [
        "15",
        "6"
      ],
      [
        "3",
        "40"
      ],
      [
        "78",
        "4"
      ],
      [
        "3",
        "70"
      ],
      [
        "39",
        "2"
      ],
      [
        "1",
        "17"
      ],
      [
        "3",
        "25"
      ],
      [
        "13",
        "8"
      ],
      [
        "3",
        "28"
      ],
      [
        "36",
        "8"
      ],
      [
        "3",
        "80"
      ],
      [
        "7",
        "36"
      ],
      [
        "9",
        "20"
      ],
      [
        "25",
        "2"
      ],
      [
        "2",
        "26"
      ],
      [
        "13",
        "2"
      ],
      [
        "3",
        "90"
      ],
      [
        "5",
        "1"
      ],
      [
        "9",
        "1"
      ],
      [
        "26",
        "4"
      ],
      [
        "76",
        "8"
      ],
      [
        "19",
        "5"
      ],
      [
        "2",
        "35"
      ],
      [
        "3",
        "48"
      ],
      [
        "20",
        "4"
      ],
      [
        "2",
        "14"
      ],
      [
        "4",
        "20"
      ],
      [
        "18",
        "2"
      ],
      [
        "7",
        "60"
      ],
      [
        "10",
        "6"
      ],
      [
        "3",
        "15"
      ],
      [
        "9",
        "90"
      ],
      [
        "17",
        "8"
      ],
      [
        "19",
        "2"
      ],
      [
        "25",
        "8"
      ],
      [
        "7",
        "40"
      ],
      [
        "28",
        "4"
      ],
      [
        "5",
        "12"
      ],
      [
        "19",
        "6"
      ],
      [
        "2",
        "16"
      ],
      [
        "6",
        "60"
      ],
      [
        "16",
        "4"
      ],
      [
        "19",
        "8"
      ],
      [
        "25",
        "5"
      ],
      [
        "3",
        "30"
      ],
      [
        "3",
        "96"
      ],
      [
        "15",
        "2"
      ],
      [
        "35",
        "6"
      ],
      [
        "2",
        "72"
      ],
      [
        "3",
        "44"
      ],
      [
        "5",
        "20"
      ],
      [
        "17",
        "5"
      ],
      [
        "14",
        "9"
      ],
      [
        "7",
        "70"
      ],
      [
        "24",
        "4"
      ],
      [
        "19",
        "7"
      ],
      [
        "50",
        "0"
      ],
      [
        "2",
        "36"
      ],
      [
        "3",
        "26"
      ],
      [
        "3",
        "98"
      ],
      [
        "4",
        "40"
      ],
      [
        "5",
        "60"
      ],
      [
        "9",
        "44"
      ],
      [
        "16",
        "9"
      ],
      [
        "95",
        "2"
      ],
      [
        "3",
        "45"
      ],
      [
        "3",
        "38"
      ],
      [
        "18",
        "7"
      ],
      [
        "2",
        "18"
      ],
      [
        "3",
        "75"
      ],
      [
        "50",
        "4"
      ],
      [
        "5",
        "44"
      ],
      [
        "26",
        "6"
      ],
      [
        "76",
        "6"
      ],
      [
        "3",
        "17"
      ],
      [
        "3",
        "78"
      ],
      [
        "9",
        "70"
      ],
      [
        "40",
        "5"
      ],
      [
        "14",
        "6"
      ],
      [
        "4",
        "90"
      ],
      [
        "28",
        "6"
      ],
      [
        "14",
        "5"
      ],
      [
        "25",
        "4"
      ],
      [
        "2",
        "60"
      ],
      [
        "2",
        "75"
      ],
      [
        "24",
        "5"
      ],
      [
        "96",
        "8"
      ],
      [
        "70",
        "4"
      ],
      [
        "37",
        "7"
      ],
      [
        "6",
        "56"
      ],
      [
        "7",
        "80"
      ],
      [
        "12",
        "4"
      ],
      [
        "13",
        "3"
      ],
      [
        "17",
        "4"
      ],
      [
        "18",
        "5"
      ],
      [
        "90",
        "5"
      ],
      [
        "2",
        "17"
      ],
      [
        "14",
        "8"
      ],
      [
        "2",
        "76"
      ],
      [
        "6",
        "95"
      ],
      [
        "15",
        "5"
      ],
      [
        "2",
        "94"
      ],
      [
        "7",
        "95"
      ],
      [
        "20",
        "9"
      ],
      [
        "10",
        "9"
      ],
      [
        "15",
        "4"
      ],
      [
        "13",
        "4"
      ],
      [
        "60",
        "8"
      ],
      [
        "30",
        "5"
      ],
      [
        "30",
        "8"
      ],
      [
        "35",
        "2"
      ],
      [
        "10",
        "7"
      ],
      [
        "45",
        "6"
      ],
      [
        "26",
        "5"
      ],
      [
        "38",
        "5"
      ],
      [
        "4",
        "16"
      ],
      [
        "4",
        "76"
      ],
      [
        "7",
        "92"
      ],
      [
        "8",
        "64"
      ],
      [
        "13",
        "7"
      ],
      [
        "19",
        "4"
      ],
      [
        "98",
        "4"
      ],
      [
        "37",
        "4"
      ],
      [
        "20",
        "6"
      ],
      [
        "35",
        "4"
      ],
      [
        "32",
        "9"
      ],
      [
        "98",
        "8"
      ],
      [
        "3",
        "24"
      ],
      [
        "80",
        "8"
      ],
      [
        "13",
        "9"
      ],
      [
        "26",
        "8"
      ],
      [
        "100",
        "8"
      ],
      [
        "96",
        "4"
      ],
      [
        "45",
        "8"
      ],
      [
        "3",
        "14"
      ],
      [
        "4",
        "48"
      ],
      [
        "9",
        "35"
      ],
      [
        "78",
        "8"
      ],
      [
        "2",
        "25"
      ],
      [
        "3",
        "10"
      ],
      [
        "4",
        "32"
      ],
      [
        "16",
        "2"
      ],
      [
        "46",
        "5"
      ],
      [
        "2",
        "70"
      ],
      [
        "9",
        "75"
      ],
      [
        "20",
        "5"
      ],
      [
        "75",
        "6"
      ],
      [
        "5",
        "16"
      ],
      [
        "5",
        "76"
      ],
      [
        "7",
        "98"
      ],
      [
        "60",
        "6"
      ],
      [
        "2",
        "10"
      ],
      [
        "3",
        "35"
      ],
      [
        "4",
        "14"
      ],
      [
        "36",
        "4"
      ],
      [
        "95",
        "5"
      ],
      [
        "9",
        "45"
      ],
      [
        "12",
        "9"
      ],
      [
        "18",
        "8"
      ],
      [
        "48",
        "6"
      ],
      [
        "3",
        "72"
      ],
      [
        "7",
        "28"
      ],
      [
        "8",
        "65"
      ],
      [
        "48",
        "8"
      ],
      [
        "94",
        "9"
      ],
      [
        "7",
        "90"
      ],
      [
        "12",
        "80"
      ],
      [
        "18",
        "6"
      ],
      [
        "90",
        "8"
      ],
      [
        "95",
        "6"
      ],
      [
        "6",
        "12"
      ],
      [
        "7",
        "48"
      ],
      [
        "9",
        "40"
      ],
      [
        "18",
        "9"
      ],
      [
        "55",
        "5"
      ],
      [
        "2",
        "39"
      ],
      [
        "3",
        "1"
      ],
      [
        "3",
        "13"
      ],
      [
        "9",
        "13"
      ],
      [
        "4",
        "18"
      ],
      [
        "4",
        "30"
      ],
      [
        "6",
        "27"
      ],
      [
        "48",
        "5"
      ],
      [
        "55",
        "2"
      ],
      [
        "76",
        "4"
      ],
      [
        "22",
        "7"
      ],
      [
        "2",
        "98"
      ],
      [
        "6",
        "25"
      ],
      [
        "70",
        "5"
      ],
      [
        "34",
        "6"
      ],
      [
        "56",
        "8"
      ],
      [
        "2",
        "28"
      ],
      [
        "3",
        "16"
      ],
      [
        "90",
        "4"
      ],
      [
        "75",
        "9"
      ],
      [
        "56",
        "5"
      ],
      [
        "39",
        "9"
      ],
      [
        "7",
        "45"
      ],
      [
        "26",
        "3"
      ],
      [
        "32",
        "2"
      ],
      [
        "97",
        "4"
      ],
      [
        "7",
        "44"
      ],
      [
        "10",
        "88"
      ],
      [
        "14",
        "40"
      ],
      [
        "24",
        "6"
      ],
      [
        "36",
        "6"
      ],
      [
        "35",
        "5"
      ],
      [
        "7",
        "39"
      ],
      [
        "10",
        "2"
      ],
      [
        "45",
        "5"
      ],
      [
        "76",
        "5"
      ],
      [
        "2",
        "90"
      ],
      [
        "5",
        "34"
      ],
      [
        "6",
        "65"
      ],
      [
        "7",
        "46"
      ],
      [
        "10",
        "56"
      ],
      [
        "35",
        "7"
      ],
      [
        "96",
        "6"
      ],
      [
        "3",
        "19"
      ],
      [
        "6",
        "16"
      ],
      [
        "75",
        "8"
      ],
      [
        "3",
        "95"
      ],
      [
        "7",
        "16"
      ],
      [
        "14",
        "80"
      ],
      [
        "70",
        "8"
      ],
      [
        "34",
        "9"
      ],
      [
        "2",
        "13"
      ],
      [
        "80",
        "6"
      ],
      [
        "17",
        "2"
      ],
      [
        "17",
        "28"
      ],
      [
        "5",
        "18"
      ],
      [
        "6",
        "90"
      ],
      [
        "6",
        "78"
      ],
      [
        "6",
        "88"
      ],
      [
        "7",
        "78"
      ],
      [
        "9",
        "12"
      ],
      [
        "9",
        "15"
      ],
      [
        "9",
        "72"
      ],
      [
        "98",
        "6"
      ],
      [
        "65",
        "8"
      ],
      [
        "7",
        "72"
      ],
      [
        "9",
        "28"
      ],
      [
        "9",
        "76"
      ],
      [
        "2",
        "78"
      ],
      [
        "4",
        "75"
      ],
      [
        "7",
        "30"
      ],
      [
        "7",
        "38"
      ],
      [
        "60",
        "5"
      ],
      [
        "35",
        "8"
      ],
      [
        "45",
        "2"
      ],
      [
        "3",
        "18"
      ],
      [
        "3",
        "39"
      ],
      [
        "7",
        "12"
      ],
      [
        "7",
        "94"
      ],
      [
        "8",
        "25"
      ],
      [
        "12",
        "96"
      ],
      [
        "75",
        "4"
      ],
      [
        "38",
        "6"
      ],
      [
        "88",
        "8"
      ],
      [
        "7",
        "19"
      ],
      [
        "18",
        "75"
      ],
      [
        "46",
        "4"
      ],
      [
        "3",
        "37"
      ],
      [
        "9",
        "19"
      ],
      [
        "12",
        "54"
      ],
      [
        "96",
        "5"
      ],
      [
        "48",
        "96"
      ],
      [
        "2",
        "34"
      ],
      [
        "2",
        "33"
      ],
      [
        "4",
        "39"
      ],
      [
        "5",
        "98"
      ],
      [
        "6",
        "46"
      ],
      [
        "8",
        "36"
      ],
      [
        "9",
        "16"
      ],
      [
        "14",
        "3"
      ],
      [
        "50",
        "8"
      ],
      [
        "37",
        "40"
      ],
      [
        "68",
        "6"
      ],
      [
        "7",
        "10"
      ],
      [
        "9",
        "92"
      ],
      [
        "14",
        "2"
      ],
      [
        "60",
        "2"
      ],
      [
        "19",
        "80"
      ],
      [
        "25",
        "92"
      ],
      [
        "28",
        "5"
      ],
      [
        "98",
        "7"
      ],
      [
        "110",
        "4"
      ],
      [
        "1",
        "100"
      ],
      [
        "4",
        "37"
      ],
      [
        "5",
        "40"
      ],
      [
        "5",
        "36"
      ],
      [
        "7",
        "24"
      ],
      [
        "16",
        "90"
      ],
      [
        "23",
        "1"
      ],
      [
        "119",
        "8"
      ],
      [
        "4",
        "35"
      ],
      [
        "4",
        "95"
      ],
      [
        "5",
        "96"
      ],
      [
        "5",
        "74"
      ],
      [
        "6",
        "48"
      ],
      [
        "7",
        "75"
      ],
      [
        "8",
        "33"
      ],
      [
        "10",
        "85"
      ],
      [
        "16",
        "6"
      ],
      [
        "12",
        "2"
      ],
      [
        "15",
        "7"
      ],
      [
        "80",
        "4"
      ],
      [
        "13",
        "30"
      ],
      [
        "98",
        "5"
      ],
      [
        "65",
        "7"
      ],
      [
        "110",
        "8"
      ],
      [
        "140",
        "0"
      ],
      [
        "150",
        "0"
      ],
      [
        "190",
        "4"
      ],
      [
        "2",
        "19"
      ],
      [
        "2",
        "95"
      ],
      [
        "4",
        "36"
      ],
      [
        "7",
        "17"
      ],
      [
        "8",
        "40"
      ],
      [
        "9",
        "10"
      ],
      [
        "12",
        "85"
      ],
      [
        "15",
        "68"
      ],
      [
        "19",
        "38"
      ],
      [
        "25",
        "68"
      ],
      [
        "98",
        "60"
      ],
      [
        "44",
        "32"
      ],
      [
        "34",
        "48"
      ],
      [
        "50",
        "7"
      ],
      [
        "55",
        "8"
      ],
      [
        "42",
        "9"
      ],
      [
        "11",
        "20"
      ],
      [
        "5",
        "28"
      ],
      [
        "5",
        "94"
      ],
      [
        "8",
        "17"
      ],
      [
        "9",
        "24"
      ],
      [
        "9",
        "22"
      ],
      [
        "16",
        "55"
      ],
      [
        "12",
        "32"
      ],
      [
        "95",
        "20"
      ],
      [
        "27",
        "3"
      ],
      [
        "27",
        "20"
      ],
      [
        "4",
        "70"
      ],
      [
        "4",
        "77"
      ],
      [
        "6",
        "20"
      ],
      [
        "8",
        "76"
      ],
      [
        "8",
        "32"
      ],
      [
        "10",
        "40"
      ],
      [
        "76",
        "2"
      ],
      [
        "48",
        "4"
      ],
      [
        "38",
        "8"
      ],
      [
        "32",
        "7"
      ],
      [
        "44",
        "12"
      ],
      [
        "22",
        "2"
      ],
      [
        "42",
        "40"
      ],
      [
        "300",
        "0"
      ],
      [
        "4",
        "17"
      ],
      [
        "6",
        "72"
      ],
      [
        "9",
        "32"
      ],
      [
        "9",
        "97"
      ],
      [
        "20",
        "16"
      ],
      [
        "18",
        "85"
      ],
      [
        "46",
        "8"
      ],
      [
        "97",
        "90"
      ],
      [
        "2",
        "32"
      ],
      [
        "5",
        "95"
      ],
      [
        "14",
        "7"
      ],
      [
        "14",
        "56"
      ],
      [
        "19",
        "70"
      ],
      [
        "44",
        "2"
      ],
      [
        "46",
        "2"
      ],
      [
        "27",
        "36"
      ],
      [
        "113",
        "0"
      ],
      [
        "1",
        "168"
      ],
      [
        "2",
        "160"
      ],
      [
        "3",
        "32"
      ],
      [
        "5",
        "14"
      ],
      [
        "5",
        "70"
      ],
      [
        "5",
        "78"
      ],
      [
        "6",
        "29"
      ],
      [
        "10",
        "45"
      ],
      [
        "15",
        "3"
      ],
      [
        "13",
        "75"
      ],
      [
        "13",
        "52"
      ],
      [
        "17",
        "9"
      ],
      [
        "17",
        "60"
      ],
      [
        "45",
        "99"
      ],
      [
        "98",
        "20"
      ],
      [
        "78",
        "60"
      ],
      [
        "64",
        "80"
      ],
      [
        "3",
        "34"
      ],
      [
        "5",
        "26"
      ],
      [
        "5",
        "38"
      ],
      [
        "5",
        "73"
      ],
      [
        "7",
        "18"
      ],
      [
        "7",
        "37"
      ],
      [
        "9",
        "38"
      ],
      [
        "10",
        "38"
      ],
      [
        "16",
        "77"
      ],
      [
        "40",
        "6"
      ],
      [
        "13",
        "60"
      ],
      [
        "30",
        "40"
      ],
      [
        "90",
        "2"
      ],
      [
        "45",
        "4"
      ],
      [
        "32",
        "3"
      ],
      [
        "95",
        "68"
      ],
      [
        "72",
        "9"
      ],
      [
        "39",
        "77"
      ],
      [
        "94",
        "90"
      ],
      [
        "68",
        "4"
      ],
      [
        "6",
        "30"
      ],
      [
        "7",
        "35"
      ],
      [
        "9",
        "30"
      ],
      [
        "12",
        "90"
      ],
      [
        "15",
        "20"
      ],
      [
        "13",
        "25"
      ],
      [
        "13",
        "76"
      ],
      [
        "18",
        "72"
      ],
      [
        "30",
        "24"
      ],
      [
        "45",
        "80"
      ],
      [
        "26",
        "40"
      ],
      [
        "26",
        "90"
      ],
      [
        "84",
        "7"
      ],
      [
        "23",
        "96"
      ],
      [
        "2",
        "92"
      ],
      [
        "3",
        "180"
      ],
      [
        "4",
        "34"
      ],
      [
        "5",
        "56"
      ],
      [
        "6",
        "15"
      ],
      [
        "6",
        "64"
      ],
      [
        "8",
        "96"
      ],
      [
        "9",
        "26"
      ],
      [
        "15",
        "50"
      ],
      [
        "13",
        "28"
      ],
      [
        "13",
        "44"
      ],
      [
        "14",
        "75"
      ],
      [
        "90",
        "9"
      ],
      [
        "36",
        "54"
      ],
      [
        "35",
        "12"
      ],
      [
        "38",
        "1"
      ],
      [
        "38",
        "78"
      ],
      [
        "34",
        "2"
      ],
      [
        "34",
        "96"
      ],
      [
        "50",
        "40"
      ],
      [
        "39",
        "60"
      ],
      [
        "39",
        "75"
      ],
      [
        "88",
        "4"
      ],
      [
        "37",
        "34"
      ],
      [
        "120",
        "0"
      ],
      [
        "118",
        "8"
      ],
      [
        "2",
        "12"
      ],
      [
        "2",
        "97"
      ],
      [
        "4",
        "96"
      ],
      [
        "4",
        "99"
      ],
      [
        "5",
        "30"
      ],
      [
        "5",
        "24"
      ],
      [
        "5",
        "92"
      ],
      [
        "6",
        "96"
      ],
      [
        "7",
        "99"
      ],
      [
        "8",
        "1"
      ],
      [
        "9",
        "18"
      ],
      [
        "9",
        "17"
      ],
      [
        "20",
        "56"
      ],
      [
        "10",
        "32"
      ],
      [
        "18",
        "60"
      ],
      [
        "30",
        "6"
      ],
      [
        "19",
        "20"
      ],
      [
        "28",
        "9"
      ],
      [
        "96",
        "64"
      ],
      [
        "97",
        "60"
      ],
      [
        "52",
        "80"
      ],
      [
        "160",
        "0"
      ],
      [
        "79",
        "25"
      ],
      [
        "49",
        "28"
      ],
      [
        "3",
        "135"
      ],
      [
        "4",
        "10"
      ],
      [
        "6",
        "34"
      ],
      [
        "6",
        "50"
      ],
      [
        "7",
        "76"
      ],
      [
        "8",
        "45"
      ],
      [
        "10",
        "25"
      ],
      [
        "15",
        "48"
      ],
      [
        "13",
        "20"
      ],
      [
        "13",
        "80"
      ],
      [
        "14",
        "16"
      ],
      [
        "18",
        "30"
      ],
      [
        "25",
        "35"
      ],
      [
        "24",
        "3"
      ],
      [
        "35",
        "90"
      ],
      [
        "98",
        "2"
      ],
      [
        "34",
        "38"
      ],
      [
        "62",
        "10"
      ],
      [
        "5",
        "84"
      ],
      [
        "6",
        "10"
      ],
      [
        "6",
        "80"
      ],
      [
        "9",
        "36"
      ],
      [
        "20",
        "46"
      ],
      [
        "10",
        "75"
      ],
      [
        "10",
        "980"
      ],
      [
        "15",
        "9"
      ],
      [
        "15",
        "88"
      ],
      [
        "15",
        "94"
      ],
      [
        "15",
        "84"
      ],
      [
        "14",
        "30"
      ],
      [
        "14",
        "78"
      ],
      [
        "60",
        "20"
      ],
      [
        "30",
        "55"
      ],
      [
        "19",
        "42"
      ],
      [
        "25",
        "10"
      ],
      [
        "24",
        "7"
      ],
      [
        "28",
        "7"
      ],
      [
        "28",
        "65"
      ],
      [
        "45",
        "76"
      ],
      [
        "26",
        "84"
      ],
      [
        "48",
        "3"
      ],
      [
        "48",
        "7"
      ],
      [
        "95",
        "4"
      ],
      [
        "95",
        "80"
      ],
      [
        "27",
        "4"
      ],
      [
        "115",
        "2"
      ],
      [
        "3",
        "11"
      ],
      [
        "4",
        "78"
      ],
      [
        "4",
        "27"
      ],
      [
        "7",
        "1"
      ],
      [
        "10",
        "80"
      ],
      [
        "16",
        "40"
      ],
      [
        "40",
        "7"
      ],
      [
        "40",
        "92"
      ],
      [
        "13",
        "45"
      ],
      [
        "17",
        "1"
      ],
      [
        "19",
        "48"
      ],
      [
        "25",
        "80"
      ],
      [
        "96",
        "68"
      ],
      [
        "39",
        "3"
      ],
      [
        "22",
        "9"
      ],
      [
        "85",
        "12"
      ],
      [
        "100",
        "0"
      ],
      [
        "400",
        "0"
      ],
      [
        "450",
        "0"
      ],
      [
        "1",
        "160"
      ],
      [
        "5",
        "45"
      ],
      [
        "5",
        "50"
      ],
      [
        "5",
        "46"
      ],
      [
        "6",
        "24"
      ],
      [
        "7",
        "15"
      ],
      [
        "7",
        "14"
      ],
      [
        "8",
        "48"
      ],
      [
        "9",
        "34"
      ],
      [
        "9",
        "33"
      ],
      [
        "15",
        "36"
      ],
      [
        "14",
        "85"
      ],
      [
        "18",
        "36"
      ],
      [
        "17",
        "56"
      ],
      [
        "25",
        "70"
      ],
      [
        "36",
        "96"
      ],
      [
        "96",
        "2"
      ],
      [
        "26",
        "24"
      ],
      [
        "26",
        "46"
      ],
      [
        "98",
        "54"
      ],
      [
        "46",
        "6"
      ],
      [
        "46",
        "60"
      ],
      [
        "37",
        "70"
      ],
      [
        "55",
        "44"
      ],
      [
        "99",
        "12"
      ],
      [
        "11",
        "80"
      ],
      [
        "226",
        "2"
      ],
      [
        "4",
        "22"
      ],
      [
        "5",
        "48"
      ],
      [
        "5",
        "22"
      ],
      [
        "6",
        "45"
      ],
      [
        "6",
        "99"
      ],
      [
